In [1]:
import numpy as np

In [3]:
import pandas as pd

AttributeError: module 'pandas' has no attribute 'set'

In [9]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [5]:
labels

['a', 'b', 'c']

In [10]:
my_data

[10, 20, 30]

In [7]:
arr

array([10, 20, 30])

In [8]:
d

{'a': 10, 'b': 20, 'c': 30}

In [12]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [14]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [16]:
pd.Series(my_data,labels)
#contando que esteja em ordem

a    10
b    20
c    30
dtype: int64

In [17]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [18]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [19]:
labels

['a', 'b', 'c']

In [22]:
ser1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [24]:
ser2 = pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [25]:
ser1['USA']

1

In [26]:
ser2['USA']

1

In [27]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [28]:
from numpy.random import randn

In [32]:
np.random.seed(101)

In [69]:
df = pd.DataFrame(randn(5,4),['a','b','c','d','e'],['w','x','y','z'])

In [70]:
df

          w         x         y         z
a  0.386030  2.084019 -0.376519  0.230336
b  0.681209  1.035125 -0.031160  1.939932
c -1.005187 -0.741790  0.187125 -0.732845
d -1.382920  1.482495  0.961458 -2.141212
e  0.992573  1.192241 -1.046780  1.292765

In [35]:
df['w']
#USA ESSE AQUI

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: w, dtype: float64

In [36]:
df.w

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: w, dtype: float64

In [46]:
df[['w','z']]

          w         z
a  0.302665 -1.159119
b -0.134841  0.184502
c  0.807706  0.329646
d -0.497104  0.484752
e -0.116773  1.996652

In [72]:
df['new'] = df['w'] + df['y']

In [65]:
df

          w         x         y         z       new
a -0.993263  0.196800 -1.136645  0.000366 -2.129908
b  1.025984 -0.156598 -0.031579  0.649826  0.994405
c  2.154846 -0.610259 -0.755325 -0.346419  1.399521
d  0.147027 -0.479448  0.558769  1.024810  0.705796
e -0.925874  1.862864 -1.133817  0.610478 -2.059691

In [57]:
df.drop('new',axis=1)
#tem que colocar o (inplace = True) pra manter

          w         x         y         z
a  0.302665  1.693723 -1.706086 -1.159119
b -0.134841  0.390528  0.166905  0.184502
c  0.807706  0.072960  0.638787  0.329646
d -0.497104 -0.754070 -0.943406  0.484752
e -0.116773  1.901755  0.238127  1.996652

In [73]:
df.drop('new',axis=1,inplace=True)

In [75]:
df

          w         x         y         z
a  0.386030  2.084019 -0.376519  0.230336
b  0.681209  1.035125 -0.031160  1.939932
c -1.005187 -0.741790  0.187125 -0.732845
d -1.382920  1.482495  0.961458 -2.141212
e  0.992573  1.192241 -1.046780  1.292765

In [81]:
df.loc['c']

w   -1.005187
x   -0.741790
y    0.187125
z   -0.732845
Name: c, dtype: float64

In [77]:
df.iloc[2]

w   -1.005187
x   -0.741790
y    0.187125
z   -0.732845
Name: c, dtype: float64

In [82]:
df.loc['a','w']

0.3860303121135517

In [83]:
df.loc[['a','b'],['w','y']]

          w         y
a  0.386030 -0.376519
b  0.681209 -0.031160

In [84]:
df

          w         x         y         z
a  0.386030  2.084019 -0.376519  0.230336
b  0.681209  1.035125 -0.031160  1.939932
c -1.005187 -0.741790  0.187125 -0.732845
d -1.382920  1.482495  0.961458 -2.141212
e  0.992573  1.192241 -1.046780  1.292765

In [85]:
df > 0

       w      x      y      z
a   True   True  False   True
b   True   True  False   True
c  False  False   True  False
d  False   True   True  False
e   True   True  False   True

In [86]:
booldf = df > 0

In [87]:
df[booldf]

          w         x         y         z
a  0.386030  2.084019       NaN  0.230336
b  0.681209  1.035125       NaN  1.939932
c       NaN       NaN  0.187125       NaN
d       NaN  1.482495  0.961458       NaN
e  0.992573  1.192241       NaN  1.292765

In [88]:
df[df>0]

          w         x         y         z
a  0.386030  2.084019       NaN  0.230336
b  0.681209  1.035125       NaN  1.939932
c       NaN       NaN  0.187125       NaN
d       NaN  1.482495  0.961458       NaN
e  0.992573  1.192241       NaN  1.292765

In [89]:
df['w']>0

a     True
b     True
c    False
d    False
e     True
Name: w, dtype: bool

In [90]:
df[df['w']>0]

          w         x         y         z
a  0.386030  2.084019 -0.376519  0.230336
b  0.681209  1.035125 -0.031160  1.939932
e  0.992573  1.192241 -1.046780  1.292765

In [92]:
df[df['z']<0]

          w         x         y         z
c -1.005187 -0.741790  0.187125 -0.732845
d -1.382920  1.482495  0.961458 -2.141212

In [93]:
df[df['z']<0]['y']

c    0.187125
d    0.961458
Name: y, dtype: float64

In [95]:
df[df['z']<0][['y','x']]

          y         x
c  0.187125 -0.741790
d  0.961458  1.482495

In [96]:
df

          w         x         y         z
a  0.386030  2.084019 -0.376519  0.230336
b  0.681209  1.035125 -0.031160  1.939932
c -1.005187 -0.741790  0.187125 -0.732845
d -1.382920  1.482495  0.961458 -2.141212
e  0.992573  1.192241 -1.046780  1.292765

In [99]:
df[(df['w']>0)&(df['y']<0)]

          w         x         y         z
a  0.386030  2.084019 -0.376519  0.230336
b  0.681209  1.035125 -0.031160  1.939932
e  0.992573  1.192241 -1.046780  1.292765

In [100]:
# & substitui o and
# | substitui o or

In [101]:
df

          w         x         y         z
a  0.386030  2.084019 -0.376519  0.230336
b  0.681209  1.035125 -0.031160  1.939932
c -1.005187 -0.741790  0.187125 -0.732845
d -1.382920  1.482495  0.961458 -2.141212
e  0.992573  1.192241 -1.046780  1.292765

In [109]:
df.reset_index()
#tem que colocar o (inplace = True) pra manter

  index         w         x         y         z States
0     a  0.386030  2.084019 -0.376519  0.230336     CA
1     b  0.681209  1.035125 -0.031160  1.939932     NY
2     c -1.005187 -0.741790  0.187125 -0.732845     WY
3     d -1.382920  1.482495  0.961458 -2.141212     OR
4     e  0.992573  1.192241 -1.046780  1.292765     CO

In [110]:
df

          w         x         y         z States
a  0.386030  2.084019 -0.376519  0.230336     CA
b  0.681209  1.035125 -0.031160  1.939932     NY
c -1.005187 -0.741790  0.187125 -0.732845     WY
d -1.382920  1.482495  0.961458 -2.141212     OR
e  0.992573  1.192241 -1.046780  1.292765     CO

In [103]:
newind = 'CA NY WY OR CO'.split()

In [104]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [105]:
df['States'] = newind

In [106]:
df

          w         x         y         z States
a  0.386030  2.084019 -0.376519  0.230336     CA
b  0.681209  1.035125 -0.031160  1.939932     NY
c -1.005187 -0.741790  0.187125 -0.732845     WY
d -1.382920  1.482495  0.961458 -2.141212     OR
e  0.992573  1.192241 -1.046780  1.292765     CO

In [107]:
df.set_index('States')
#tem que colocar o (inplace = True) pra manter

               w         x         y         z
States
CA      0.386030  2.084019 -0.376519  0.230336
NY      0.681209  1.035125 -0.031160  1.939932
WY     -1.005187 -0.741790  0.187125 -0.732845
OR     -1.382920  1.482495  0.961458 -2.141212
CO      0.992573  1.192241 -1.046780  1.292765

In [108]:
df
#tem que colocar o (inplace = True) pra manter

          w         x         y         z States
a  0.386030  2.084019 -0.376519  0.230336     CA
b  0.681209  1.035125 -0.031160  1.939932     NY
c -1.005187 -0.741790  0.187125 -0.732845     WY
d -1.382920  1.482495  0.961458 -2.141212     OR
e  0.992573  1.192241 -1.046780  1.292765     CO

In [117]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [113]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [114]:
inside

[1, 2, 3, 1, 2, 3]

In [118]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [119]:
df = pd.DataFrame(randn(6,2),hier_index,['a','b'])

In [120]:
df

             a         b
G1 1 -1.467514 -0.494095
   2 -0.162535  0.485809
   3  0.392489  0.221491
G2 1 -0.855196  1.541990
   2  0.666319 -0.538235
   3 -0.568581  1.407338

In [121]:
df.loc['G1']

          a         b
1 -1.467514 -0.494095
2 -0.162535  0.485809
3  0.392489  0.221491

In [127]:
df.loc['G1'].loc[1]

a   -1.467514
b   -0.494095
Name: 1, dtype: float64

In [128]:
df.loc['G1'].loc[1]['a']

-1.4675140203361003

In [129]:
df

             a         b
G1 1 -1.467514 -0.494095
   2 -0.162535  0.485809
   3  0.392489  0.221491
G2 1 -0.855196  1.541990
   2  0.666319 -0.538235
   3 -0.568581  1.407338

In [130]:
df.index.names = ['groups','nums']

In [133]:
df

                    a         b
groups nums
G1     1    -1.467514 -0.494095
       2    -0.162535  0.485809
       3     0.392489  0.221491
G2     1    -0.855196  1.541990
       2     0.666319 -0.538235
       3    -0.568581  1.407338

In [137]:
df.loc['G1'].loc[1]

a   -1.467514
b   -0.494095
Name: 1, dtype: float64

In [138]:
df.loc['G2'].loc[1]

a   -0.855196
b    1.541990
Name: 1, dtype: float64

In [132]:
df.xs(1,level = 'nums')

               a         b
groups
G1     -1.467514 -0.494095
G2     -0.855196  1.541990

In [139]:
d = {'a':[1,2,np.nan],'b':[1,np.nan,np.nan],'c':[1,2,3]}

In [142]:
df = pd.DataFrame(d)

In [143]:
df

     a    b  c
0  1.0  1.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [144]:
df.dropna()
#deleta as linhas com nan, nullvalues

     a    b  c
0  1.0  1.0  1

In [145]:
df.dropna(axis=1)
#deleta as colunas

   c
0  1
1  2
2  3

In [146]:
df.dropna(thresh=2)
#minimo de nulos pra tirar a linha

     a    b  c
0  1.0  1.0  1
1  2.0  NaN  2

In [147]:
df

     a    b  c
0  1.0  1.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [148]:
df.fillna(value = 'FILLER')

        a       b  c
0       1       1  1
1       2  FILLER  2
2  FILLER  FILLER  3

In [149]:
df['a'].fillna(value=df['a'].mean())
#df['a'].mean() media dos valores na coluna

0    1.0
1    2.0
2    1.5
Name: a, dtype: float64

In [3]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [4]:
df =pd.DataFrame(data)

In [153]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [155]:
bycomp = df.groupby('Company')

In [157]:
bycomp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [159]:
bycomp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [160]:
bycomp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [161]:
bycomp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [162]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [163]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [6]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [7]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [8]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [9]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [10]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [11]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [12]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [46]:
pd.concat([df1,df2,df3])
#uma embaixo da outra

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [47]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [48]:
pd.concat([df1,df2,df3],axis=1).fillna(0)

     A   B   C   D   A   B   C   D    A    B    C    D
0   A0  B0  C0  D0   0   0   0   0    0    0    0    0
1   A1  B1  C1  D1   0   0   0   0    0    0    0    0
2   A2  B2  C2  D2   0   0   0   0    0    0    0    0
3   A3  B3  C3  D3   0   0   0   0    0    0    0    0
4    0   0   0   0  A4  B4  C4  D4    0    0    0    0
5    0   0   0   0  A5  B5  C5  D5    0    0    0    0
6    0   0   0   0  A6  B6  C6  D6    0    0    0    0
7    0   0   0   0  A7  B7  C7  D7    0    0    0    0
8    0   0   0   0   0   0   0   0   A8   B8   C8   D8
9    0   0   0   0   0   0   0   0   A9   B9   C9   D9
10   0   0   0   0   0   0   0   0  A10  B10  C10  D10
11   0   0   0   0   0   0   0   0  A11  B11  C11  D11

In [15]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [16]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [17]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [18]:
pd.merge(left,right,how='inner',on='key')
#ordem alfabetica nas colunas

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [19]:
pd.merge(left,right,how='outer',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [20]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [23]:
pd.merge(left,right,on=['key1','key2'])
#alternando as fileiras

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [24]:
pd.merge(left,right,how='outer',on=['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [25]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [26]:
left.join(right)
#junta no mesmo index

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [27]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [28]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [29]:
df['col2'].nunique()
#number of unique values

3

In [31]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [33]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [34]:
df[(df['col1']>2)&(df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [35]:
def times2(x):
    return x*2

In [36]:
df['col1'].apply(times2)
#aplica uma funcao no dataframe

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [38]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [40]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [41]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [42]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [43]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [44]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [51]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [52]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [54]:
df.pivot_table(values='D',index=['A','B'],columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [55]:
pwd

'C:\\Users\\joao_'

In [57]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [58]:
df = pd.read_csv('example')

In [59]:
df.to_csv('output',index=False)

In [60]:
pd.read_csv('output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [64]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1',)

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [66]:
df.to_excel('Excel_Sample.xlsx',sheet_name='New_Sheet')

In [67]:
data = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [68]:
data[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
...,...,...,...,...,...,...
556,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
557,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
558,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
559,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
560,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [69]:
from sqlalchemy import create_engine

In [70]:
engine = create_engine('sqlite:///:memory:')

In [71]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [72]:
df.to_sql('my_table',engine)

In [73]:
sqldf = pd.read_sql('my_table',con=engine)

In [2]:
sqldf

NameError: name 'sqldf' is not defined

In [3]:
#ecom['Job'].value_counts()['Lawyer']

In [4]:
#ecom.set_index('Credit Card').loc[4926535242672853]['Email']

In [6]:
# (ecom['Job'].apply(lambda x: x.find('Lawyer'))).sum()+10000

In [7]:
#ecom['Email'].apply(lambda x : x.split('@').pop(1)).value_counts().head()
#como pop devolve o valor removido com resposta, removi a segunda parte, peguei a segunda parte